Revit 2027 API
TextNote.LeaderLeftAttachment Property
 Attachment position of leaders on the left side of the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LeaderAtachement LeaderLeftAttachment { get; set; }
Public Property LeaderLeftAttachment As LeaderAtachement
	Get
	Set
public:
property LeaderAtachement LeaderLeftAttachment {
	LeaderAtachement get ();
	void set (LeaderAtachement value);
}
member LeaderLeftAttachment : LeaderAtachement with get, set
Property Value
LeaderAtachement
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
The property controls the vertical position of leaders attached to the left side of the note.
Change of the value will affect all leaders currently attached to the left side.
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace